<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"9e22994e3603a5884d02b23e75e62192051bbbc907717fbaa15bc402fbaccc7b","plan_job_ref":"Job Terraform Plan #444 at https://github.com/cal-itp/data-infra/actions/runs/16951525256","plan_out_hash":"fee16f7e14704c7bc79db161d7708e5b6c7c78a02ba788620571a8a85718ad67","plan_hash":"1eeba66efc7af2b907cc4a588bb1920e7d05253a49e16a8bb4dc3a2b88fe1e74","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/iam/us__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_project_iam_custom_role.metabase_additional will be created
+   resource "google_project_iam_custom_role" "metabase_additional" {
+       deleted     = (known after apply)
+       description = "Extra permission to view all BigQuery query jobs for cost estimation"
+       id          = (known after apply)
+       name        = (known after apply)
+       permissions = [
+           "bigquery.jobs.listAll",
        ]
+       project     = "cal-itp-data-infra-staging"
+       role_id     = "******************"
+       stage       = "GA"
+       title       = "Metabase additional custom permission jobs.listAll"
    }

  # google_project_iam_member.metabase_custom_role_assignment will be created
+   resource "google_project_iam_member" "metabase_custom_role_assignment" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:metabase@cal-itp-data-infra.iam.gserviceaccount.com"
+       project = "cal-itp-data-infra-staging"
+       role    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #444](https://github.com/cal-itp/data-infra/actions/runs/16951525256)